app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "test 134"], ["body", "godd shit"], ["article_id", 13], ["created_at", "2018-09-24 23:28:52.862303"], ["updated_at", "2018-09-24 23:28:52.862303"]]